### Groupby Method

#### Group by one column

In [1]:
import pandas as pd

df = pd.DataFrame({'A': ['a', 'b', 'c', 'a', 'b', 'b'],
 'B': [2, 8, 1, 4, 3, 8],
 'C': [102, 98, 107, 104, 115, 87]})

df

   A  B    C
0  a  2  102
1  b  8   98
2  c  1  107
3  a  4  104
4  b  3  115
5  b  8   87

#### Group by column A and get the mean value of other columns:

In [2]:
df.groupby('A').mean()

          B      C
A
a  3.000000  103.0
b  6.333333  100.0
c  1.000000  107.0

#### Group by multiple columns

In [3]:
df.groupby(['A','B']).mean()

         C
A B
a 2  102.0
  4  104.0
b 3  115.0
  8   92.5
c 1  107.0

##### Note how after grouping each row in the resulting DataFrame is indexed by a tuple or MultiIndex  (in this case a pair of elements from columns A and B).

### To apply several aggregation methods at once, for instance to count the number of items in each  group and compute their mean, use the agg function:

In [9]:
df.groupby(['A','B']).agg(['count', 'mean'])

        C
    count   mean
A B
a 2     1  102.0
  4     1  104.0
b 3     1  115.0
  8     2   92.5
c 1     1  107.0

#### Grouping Numbers (Bins)

In [10]:
import numpy as np
import pandas as pd
np.random.seed(0)
df = pd.DataFrame({'Age': np.random.randint(20, 70, 100),
 'Sex': np.random.choice(['Male', 'Female'], 100),
 'number_of_foo': np.random.randint(1, 20, 100)})
df.head()

   Age     Sex  number_of_foo
0   64  Female             14
1   67  Female             14
2   20  Female             12
3   23    Male             17
4   23  Female             15


Group Age into three categories (or bins). Bins can be given as
an integer n indicating the number of bins—in this case the dataframe's data is divided into n
intervals of equal size

•a sequence of integers denoting the endpoint of the left-open intervals in which the data is
divided into—for instance bins=[19, 40, 65, np.inf] creates three age groups (19, 40], (40,65], and (65, np.inf].

•Pandas assigns automatically the string versions of the intervals as label. It is also possible to
define own labels by defining a labels parameter as a list of strings.

In [11]:
pd.cut(df['Age'], bins=4)

0       (56.75, 69.0]
1       (56.75, 69.0]
2     (19.951, 32.25]
3     (19.951, 32.25]
4     (19.951, 32.25]
           ...
95      (32.25, 44.5]
96      (32.25, 44.5]
97      (32.25, 44.5]
98      (56.75, 69.0]
99      (56.75, 69.0]
Name: Age, Length: 100, dtype: category
Categories (4, interval[float64, right]): [(19.951, 32.25] < (32.25, 44.5] < (44.5, 56.75] < (56.75, 69.0]]

In [12]:
pd.cut(df['Age'], bins=[19, 40, 65, np.inf])

0     (40.0, 65.0]
1      (65.0, inf]
2     (19.0, 40.0]
3     (19.0, 40.0]
4     (19.0, 40.0]
          ...
95    (19.0, 40.0]
96    (19.0, 40.0]
97    (40.0, 65.0]
98     (65.0, inf]
99     (65.0, inf]
Name: Age, Length: 100, dtype: category
Categories (3, interval[float64, right]): [(19.0, 40.0] < (40.0, 65.0] < (65.0, inf]]

In [13]:
age_groups = pd.cut(df['Age'], bins=[19, 40, 65, np.inf])
df.groupby(age_groups)['number_of_foo'].mean()

Age
(19.0, 40.0]    9.880000
(40.0, 65.0]    9.452381
(65.0, inf]     9.250000
Name: number_of_foo, dtype: float64

#### Cross tabulate age groups and gender:

In [14]:
pd.crosstab(age_groups, df['Sex'])

Sex           Female  Male
Age
(19.0, 40.0]      22    28
(40.0, 65.0]      18    24
(65.0, inf]        3     5

#### Column selection of a group

In [15]:
#When you do a groupby you can select either a single column or a list of columns:

df = pd.DataFrame([[1, 1, 2], [1, 2, 3], [2, 3, 4]], columns=["A", "B", "C"])

df

   A  B  C
0  1  1  2
1  1  2  3
2  2  3  4

In [16]:
g = df.groupby("A")
g['B'].mean()

A
1    1.5
2    3.0
Name: B, dtype: float64

In [17]:
 g[["B", "C"]].mean() # columns B and C

     B    C
A
1  1.5  2.5
2  3.0  4.0

In [19]:
#You can also use agg to specify columns and aggregation to perform:
g.agg({'B': 'mean', 'C': 'count'})

     B  C
A
1  1.5  2
2  3.0  1

### Aggregating by size VS by count

##### The difference between size and count is: size counts NaN values, count does not.

In [20]:
df = pd.DataFrame(
 {"Name":["Alice", "Bob", "Mallory", "Mallory", "Bob" , "Mallory"],
 "City":["Seattle", "Seattle", "Portland", "Seattle", "Seattle", "Portland"],
 "Val": [4, 3, 3, np.nan, np.nan, 4]})
df

      Name      City  Val
0    Alice   Seattle  4.0
1      Bob   Seattle  3.0
2  Mallory  Portland  3.0
3  Mallory   Seattle  NaN
4      Bob   Seattle  NaN
5  Mallory  Portland  4.0

In [21]:
df.groupby(["Name", "City"])['Val'].size().reset_index(name='Size')

      Name      City  Size
0    Alice   Seattle     1
1      Bob   Seattle     2
2  Mallory  Portland     2
3  Mallory   Seattle     1

In [22]:
df.groupby(["Name", "City"])['Val'].count().reset_index(name='Count')

      Name      City  Count
0    Alice   Seattle      1
1      Bob   Seattle      1
2  Mallory  Portland      2
3  Mallory   Seattle      0

### Aggregating groups

In [23]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'A': list('XYZXYZXYZX'), 
                   'B': [1, 2, 1, 3, 1, 2, 3, 3, 1, 2],
                 'C': [12, 14, 11, 12, 13, 14, 16, 12, 10, 19]})
df

   A  B   C
0  X  1  12
1  Y  2  14
2  Z  1  11
3  X  3  12
4  Y  1  13
5  Z  2  14
6  X  3  16
7  Y  3  12
8  Z  1  10
9  X  2  19

In [25]:
df.groupby('A').agg({'B': [np.mean, np.std], 'C': [np.sum, 'count']})

          B             C
       mean       std sum count
A
X  2.250000  0.957427  59     4
Y  2.000000  1.000000  39     3
Z  1.333333  0.577350  35     3

### Export groups in different files
##### You can iterate on the object returned by groupby(). The iterator contains (Category, DataFrame) tuples.

In [27]:
# Same example data as in the previous example.
import numpy as np
import pandas as pd

np.random.seed(0)

df = pd.DataFrame({'Age': np.random.randint(20, 70, 100),
 'Sex': np.random.choice(['Male', 'Female'], 100),
 'number_of_foo': np.random.randint(1, 20, 100)})

# Export to Male.csv and Female.csv files.
for sex, data in df.groupby('Sex'):
 data.to_csv("{}.csv".format(sex))

#### using transform to get group-level statistics while preserving the original dataframe

In [28]:
df = pd.DataFrame({'group1' : ['A', 'A', 'A', 'A',
 'B', 'B', 'B', 'B'],
 'group2' : ['C', 'C', 'C', 'D',
 'E', 'E', 'F', 'F'],
 'B' : ['one', np.NaN, np.NaN, np.NaN,
 np.NaN, 'two', np.NaN, np.NaN],
 'C' : [np.NaN, 1, np.NaN, np.NaN,
 np.NaN, np.NaN, np.NaN, 4]})

df

  group1 group2    B    C
0      A      C  one  NaN
1      A      C  NaN  1.0
2      A      C  NaN  NaN
3      A      D  NaN  NaN
4      B      E  NaN  NaN
5      B      E  two  NaN
6      B      F  NaN  NaN
7      B      F  NaN  4.0

I want to get the count of non-missing observations of B for each combination of group1 and group2.
groupby.transform is a very powerful function that does exactly that.

In [29]:
df['count_B']=df.groupby(['group1','group2']).B.transform('count')

In [30]:
df

  group1 group2    B    C  count_B
0      A      C  one  NaN        1
1      A      C  NaN  1.0        1
2      A      C  NaN  NaN        1
3      A      D  NaN  NaN        0
4      B      E  NaN  NaN        1
5      B      E  two  NaN        1
6      B      F  NaN  NaN        0
7      B      F  NaN  4.0        0